cookbook.org
:PROPERTIES:
#+STARTUP: overview inlineimages
#+TAGS: @baking @breakfast @entree @side @soup @stew @sauce @dressing
#+TAGS: GF(g)
#+OPTIONS: toc:nil
#+HUGO_BASE_DIR: /home/trevdev/Projects/os-cookbook/
#+HUGO_SECTION: recipe
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_FRONT_MATTER_FORMAT: yaml
:END:
#+TITLE: Open Source Cookbook
#+AUTHOR: "Trev"
** Lentil Stew                                                       :@stew:
:PROPERTIES:
:export_file_name: lentil-stew
:export_hugo_custom_front_matter: :servings 12
:export_hugo_custom_front_matter+: :prep-time 15
:export_hugo_custom_front_matter+: :cook-time 45
:export_hugo_custom_front_matter+: :ready-in 60
:END:
*** Ingredients

- 1 cup of lentils
- 3 cups of water
- 369 g, Tomato, Medium Whole (2-3/5" Dia), Raw
- 2 stalks, Celery
- 1 cup, pieces or slices, Mushrooms - Raw
- 1 teaspoon, Genetic Table Salt
- 1 sprinkle, Black Pepper, Ground
- 1 tbsp, Sirracha
- 1 cup 123 g, Chickpea Canned
- 3 potato, Medium Russet Potato
- 1.50 cup, chopped, Carrots - Raw
- 2 tbsp vegetable oil

*** Directions

1. Put the water and the lentils in a pot.
2. Chop up onions, carrots, potatoes & mushrooms then and add them to the pot.
3. Add basil & pepper.
4. Bring pot to boil then cook on medium for 30 minutes.
5. Add tomatoes, celery & chickpeas. Cook for an additional 15 minutes.

