content/recipe/lentil-stew.md
---
title: "Lentil Stew"
author: ["Trev"]
date: 2016-05-30T00:00:00-07:00
lastmod: 2022-05-30T19:58:43-07:00
categories: ["stew"]
draft: false
servings: 12
prep-time: 15
cook-time: 45
ready-in: 60
---

## Ingredients {#ingredients}

-   1 cup of lentils
-   3 cups of water
-   369 g, Tomato, Medium Whole (2-3/5" Dia), Raw
-   2 stalks, Celery
-   1 cup, pieces or slices, Mushrooms - Raw
-   1 teaspoon, Genetic Table Salt
-   1 sprinkle, Black Pepper, Ground
-   1 tbsp, Sirracha
-   1 cup 123 g, Chickpea Canned
-   3 potato, Medium Russet Potato
-   1.50 cup, chopped, Carrots - Raw
-   2 tbsp vegetable oil


## Directions {#directions}

1.  Put the water and the lentils in a pot.
2.  Chop up onions, carrots, potatoes &amp; mushrooms then and add them to the pot.
3.  Add basil &amp; pepper.
4.  Bring pot to boil then cook on medium for 30 minutes.
5.  Add tomatoes, celery &amp; chickpeas. Cook for an additional 15 minutes.